{
  "jobs": [
    {
      "id": "1",
      "title": "Senior React Developer",
      "type": "Full-Time",
      "description": "We are seeking an experienced Senior React Developer to lead our frontend development efforts in Boston, MA. The ideal candidate will have 5+ years of professional experience building complex web applications with React.js. You'll be responsible for architecting scalable frontend solutions, mentoring junior developers, and collaborating with our design and backend teams to deliver exceptional user experiences. Our stack includes React 18, TypeScript, Redux Toolkit, and Next.js. You should have deep expertise in React hooks, performance optimization, and modern CSS methodologies. Experience with testing frameworks like Jest and React Testing Library is required. This is a fantastic opportunity to work on high-impact projects for Fortune 500 clients while helping shape our frontend architecture and best practices.",
      "location": "Boston, MA",
      "salary": "$120K - $140K",
      "company": {
        "name": "NewTek Solutions",
        "description": "NewTek Solutions is a leading technology consultancy specializing in enterprise web applications. With over 15 years in the industry, we've delivered innovative solutions for clients across finance, healthcare, and retail sectors. Our 200+ person team values technical excellence, continuous learning, and collaborative problem-solving. We offer comprehensive benefits, professional development budgets, and flexible work arrangements.",
        "contactEmail": "careers@teksolutions.com",
        "contactPhone": "617-555-0100"
      }
    },
    {
      "id": "2",
      "title": "Front-End Engineer (React & Redux)",
      "type": "Full-Time",
      "location": "Miami, FL",
      "description": "Join our growing product team as a Front-End Engineer specializing in React and Redux. In this role, you'll develop and maintain our flagship SaaS platform used by thousands of marketing professionals daily. We're looking for someone with 3+ years of React experience who can implement complex state management solutions with Redux, optimize application performance, and ensure code quality through comprehensive testing. You'll work closely with our UX designers to translate Figma prototypes into pixel-perfect, responsive interfaces. Our tech stack includes React 18, Redux Toolkit, RTK Query, Material UI, and Cypress for E2E testing. The ideal candidate will have experience with micro-frontend architectures and module federation. This position offers the opportunity to work on challenging problems like real-time data visualization and collaborative editing features.",
      "salary": "$110K - $125K",
      "company": {
        "name": "Veneer Solutions",
        "description": "Veneer Solutions is a fast-growing MarTech company revolutionizing how brands manage their digital presence. Our all-in-one platform helps marketing teams create, publish, and analyze content across multiple channels. Founded in 2018, we've grown to serve 500+ enterprise clients with a team of 150 passionate technologists. We offer competitive compensation, equity options, and a vibrant office in downtown Miami with stunning waterfront views.",
        "contactEmail": "talent@veneersolutions.com",
        "contactPhone": "305-555-0200"
      }
    },
    {
      "id": "3",
      "title": "React.js Developer",
      "type": "Full-Time",
      "location": "Brooklyn, NY",
      "description": "We're looking for a skilled React.js Developer to join our product engineering team in Brooklyn. You'll be building innovative features for our educational platform used by millions of students worldwide. This role requires strong proficiency in React hooks, context API, and modern JavaScript (ES6+). You should have experience with responsive design principles, accessibility standards (WCAG), and performance optimization techniques. Our stack includes React 18, Next.js, Emotion CSS, and Storybook for component development. You'll collaborate with backend engineers to design GraphQL APIs and implement efficient data fetching strategies. The ideal candidate will have 4+ years of professional React experience and a portfolio demonstrating clean, maintainable code. We value developers who actively participate in code reviews, advocate for best practices, and continuously look for ways to improve our codebase and developer experience.",
      "salary": "$115K - $130K",
      "company": {
        "name": "Dolor Cloud",
        "description": "Dolor Cloud is an EdTech pioneer transforming how people learn through innovative technology solutions. Our platform combines adaptive learning algorithms with engaging content to deliver personalized education experiences. With over 10 million active users across 50 countries, we're making quality education accessible to everyone. Join our mission-driven team of 300+ employees in our modern DUMBO office featuring rooftop gardens, learning labs, and state-of-the-art collaboration spaces.",
        "contactEmail": "dev-jobs@dolorcloud.com",
        "contactPhone": "718-555-0300"
      }
    },
    {
      "id": "4",
      "title": "React Front-End Developer",
      "type": "Part-Time",
      "description": "We're seeking a part-time React Front-End Developer to help enhance our client-facing dashboard and internal tools. This 20-30 hour/week position offers flexible scheduling and the option to work remotely. You'll be implementing new UI components, improving existing features, and helping migrate our legacy codebase to modern React practices. Ideal candidates will have 2+ years of React experience and familiarity with TypeScript, React Query, and Tailwind CSS. You should be comfortable working independently while collaborating with our small but mighty engineering team through Slack and weekly syncs. Responsibilities include writing clean, documented code; participating in design reviews; and maintaining our component library. This is a great opportunity for developers seeking work-life balance or those looking to supplement their income with meaningful contract work on a well-established SaaS product.",
      "location": "Phoenix, AZ",
      "salary": "$60/hr",
      "company": {
        "name": "Alpha Elite",
        "description": "Alpha Elite provides business intelligence solutions for the hospitality industry. Our cloud-based platform helps hotels, restaurants, and venues optimize operations and guest experiences. Founded in 2015, we've grown to serve 2,000+ properties worldwide with a lean team of 25 professionals. We pride ourselves on work flexibility, transparency, and creating technology that genuinely improves our clients' businesses.",
        "contactEmail": "engineering@alphaelite.com",
        "contactPhone": "602-555-0400"
      }
    },
    {
      "id": "5",
      "title": "Full Stack React Developer",
      "type": "Full-Time",
      "description": "Join our engineering team as a Full Stack React Developer to build and maintain our e-commerce platform serving the automotive aftermarket industry. You'll work across our entire stack, from implementing responsive React components to optimizing Node.js backend services. The ideal candidate has 4+ years of experience with React and at least 2 years of backend development experience (Node.js preferred). You should be proficient with TypeScript, GraphQL, and relational databases (we use PostgreSQL). In this role, you'll architect new features, improve application performance, and help scale our infrastructure to handle increasing traffic. We value developers who take ownership of their work, proactively identify areas for improvement, and collaborate effectively with cross-functional teams. You'll have the opportunity to work on challenging problems like real-time inventory management, complex product configuration, and high-volume checkout flows.",
      "location": "Atlanta, GA",
      "salary": "$130K - $150K",
      "company": {
        "name": "Browning Technologies",
        "description": "Browning Technologies is the leading e-commerce platform for automotive parts and accessories. Our technology powers online stores for some of the biggest names in the industry, processing over $1B in annual transactions. With 300+ employees across the US, we combine deep automotive expertise with cutting-edge technology. Our Atlanta tech hub features an open, collaborative workspace with dedicated quiet zones, a fully stocked kitchen, and regular tech talks.",
        "contactEmail": "tech-careers@browningtech.com",
        "contactPhone": "404-555-0500"
      }
    },
    {
      "id": "6",
      "title": "React Native Developer",
      "type": "Full-Time",
      "description": "We're hiring a React Native Developer to lead the development of our mobile applications for both iOS and Android platforms. In this role, you'll architect and implement new features, optimize app performance, and ensure smooth user experiences across devices. You should have 3+ years of React Native experience and a strong understanding of native mobile development concepts (bridging modules, native components, etc.). Our apps handle complex financial data, so experience with offline storage, data synchronization, and secure data handling is highly valued. You'll work closely with our design team to implement beautiful, intuitive interfaces using React Native's animation APIs and gesture handling. The ideal candidate stays current with the latest React Native developments and can evaluate when to use community solutions versus building custom implementations. We're looking for someone passionate about mobile UX who can advocate for best practices in our growing mobile team.",
      "location": "Portland, OR",
      "salary": "$125K - $140K",
      "company": {
        "name": "Port Solutions INC",
        "description": "Port Solutions provides investment management technology to financial advisors and institutions. Our mobile apps give investors real-time access to their portfolios with powerful analytics and visualization tools. Established in 2010, we've grown to serve over 500 financial firms while maintaining our startup energy and commitment to innovation. Our Portland office is located in the heart of the Pearl District, offering easy access to the city's best restaurants and outdoor spaces.",
        "contactEmail": "mobile-hiring@portsolutions.com",
        "contactPhone": "503-555-0600"
      }
    },
    {
      "id": "7",
      "title": "JavaScript Engineer (React)",
      "type": "Full-Time",
      "description": "As a JavaScript Engineer specializing in React at our Chicago headquarters, you'll be building the next generation of our enterprise content management platform. This role requires deep expertise in React (4+ years) and modern JavaScript ecosystems. You'll architect reusable component libraries, implement complex interactive features, and optimize our bundle size and loading performance. Our stack includes React 18, Webpack 5, CSS-in-JS (Emotion), and a custom design system. You should have experience with monorepo management (we use Turborepo) and CI/CD pipelines. We're particularly interested in candidates who have worked on large-scale applications with hundreds of routes and complex state management needs. In this role, you'll collaborate with product managers to break down epics into technical tasks, mentor mid-level developers, and help establish frontend architecture patterns. We value clean, maintainable code and thorough testing practices (Jest + React Testing Library).",
      "location": "Chicago, IL",
      "salary": "$120K - $135K",
      "company": {
        "name": "Windy City Tech",
        "description": "Windy City Tech has been a leader in enterprise content solutions for over 20 years. Our platform powers digital experiences for Fortune 500 companies, government agencies, and educational institutions. With 500+ employees globally, we combine the stability of an established company with the innovation of a tech startup. Our Chicago headquarters features stunning views of Lake Michigan, state-of-the-art tech labs, and abundant collaboration spaces designed to spark creativity.",
        "contactEmail": "engineering-jobs@windycitytech.com",
        "contactPhone": "312-555-0700"
      }
    },
    {
      "id": "8",
      "title": "React UI Developer",
      "type": "Contract",
      "description": "We're seeking a React UI Developer for a 6-month contract to help redesign our customer portal with a fresh, modern interface. This project involves migrating our existing class components to functional components with hooks, implementing a new design system, and improving overall UX consistency. You should have 3+ years of React experience with a strong eye for design and attention to detail. Expertise in CSS architecture (we use Sass modules) and responsive design principles is essential. You'll work closely with our UX team to translate high-fidelity Figma mockups into pixel-perfect implementations while ensuring accessibility standards are met. The ideal candidate will have experience building design systems or component libraries and can document usage guidelines for our internal teams. This contract has the potential to extend or convert to full-time based on performance and business needs. We offer competitive hourly rates and flexible remote work options.",
      "location": "Austin, TX",
      "salary": "$70/hr",
      "company": {
        "name": "Lone Star Digital",
        "description": "Lone Star Digital is a boutique digital agency specializing in user experience and interface design for financial services. We combine strategic thinking with beautiful execution to create products that users love. Our small but mighty team of 15 designers and developers works with regional banks and fintech startups to transform their digital presence. Based in downtown Austin, we embrace the city's creative energy while delivering enterprise-grade solutions.",
        "contactEmail": "contracts@lonestardigital.com",
        "contactPhone": "512-555-0800"
      }
    },
    {
      "id": "9",
      "title": "Senior React Native Engineer",
      "type": "Full-Time",
      "description": "We're looking for a Senior React Native Engineer to lead development of our mobile health platform used by healthcare providers nationwide. In this critical role, you'll architect our mobile strategy, establish best practices, and mentor junior developers. You need 5+ years of mobile development experience with at least 3 years focused on React Native. Deep understanding of native iOS/Android development is required, as you'll be responsible for bridging native modules and optimizing performance across platforms. Our app handles sensitive patient data, so experience with HIPAA compliance, secure storage, and encrypted communications is highly valued. You'll collaborate with our backend team to design efficient APIs and implement offline-first functionality. We're looking for someone passionate about healthcare technology who can balance rapid iteration with the need for reliability in medical settings. This role offers the opportunity to make a real impact on patient care while working with cutting-edge mobile technologies.",
      "location": "San Francisco, CA",
      "salary": "$160K - $180K",
      "company": {
        "name": "Golden Gate Tech",
        "description": "Golden Gate Tech is revolutionizing healthcare delivery through mobile technology. Our platform enables remote patient monitoring, telehealth visits, and clinical collaboration. Founded by physicians and engineers, we've grown to serve 200+ healthcare organizations while maintaining our patient-first ethos. We offer comprehensive health benefits, generous parental leave, and opportunities to work directly with healthcare providers to understand real clinical needs.",
        "contactEmail": "mobile-hiring@goldengatetech.com",
        "contactPhone": "415-555-0900"
      }
    },
    {
      "id": "10",
      "title": "React Developer (Remote)",
      "type": "Full-Time",
      "description": "Join our fully distributed team as a Remote React Developer working on our open-source developer tools. We're looking for someone with 3+ years of React experience who thrives in an asynchronous work environment. You'll be building interactive documentation sites, demo applications, and visual debugging tools used by thousands of developers daily. Our stack includes React 18, TypeScript, Vite, and Docusaurus. You should be comfortable working with complex state management (we use Zustand) and have experience building accessible, keyboard-navigable interfaces. As part of our remote-first culture, you'll need strong written communication skills for RFCs, code reviews, and documentation. We value self-motivated developers who can identify areas for improvement and propose solutions. This role offers the flexibility to work from anywhere while contributing to meaningful projects that impact the broader developer ecosystem. You'll have opportunities to engage with our community through blog posts, conference talks, and open-source contributions.",
      "location": "Remote",
      "salary": "$130K - $145K",
      "company": {
        "name": "Digital Nomad Solutions",
        "description": "Digital Nomad Solutions creates tools for modern web developers. Our open-source libraries are downloaded millions of times each month, powering applications across industries. Since 2016, we've built a fully remote team spanning 15 countries, united by our passion for developer experience and open web standards. We offer competitive salaries adjusted for your location, generous equipment stipends, and annual team retreats in exciting destinations worldwide.",
        "contactEmail": "remote-jobs@digitalnomadsolutions.com",
        "contactPhone": "555-555-1000"
      }
    }
  ]
}